#+TITLE: Classification
#+AUTHOR: Jonas van der Ham | MSc MADE
#+EMAIL: Jonasvdham@gmail.com
#+DATE: Thursday, 21 October 2021
#+STARTUP: showall
#+PROPERTY: header-args :exports both :session class :cache no :tangle yes
:PROPERTIES:
#+OPTIONS: ^:nil
#+LATEX_COMPILER: xelatex
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [logo, color, author]
#+LATEX_HEADER: \insertauthor
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage[style=ieee, citestyle=numeric-comp, isbn=false]{biblatex}
#+LATEX_HEADER: \addbibresource{~/made/bibliography/references.bib}
#+LATEX_HEADER: \setminted{bgcolor=WhiteSmoke}
#+OPTIONS: toc:nil
:END:

* Decision tree

Let's build a tree with all features included:
#+begin_src R :results silent
tree <- tree(district ~  hou_total + hou_wheel + hou_boat + hou_sheltered + hou_protected  + hou_corporation + hou_owner + hou_rented + hou_occupants + hou_value +
hou_value_m2 + hou_satisfaction + hou_condition +
hou_maintenance + hou_neighborhood + hou_development +
hou_homefeel + inc_disposable + inc_q1 +
inc_q2 + inc_q3 + inc_q4 +
inc_q5 + inc_theil + inc_gini +
inc_social + inc_social_far + inc_disability +
inc_unemployment + inc_debt + inc_notifications, houinc)
summary(tree)
#+end_src


Variables actually used in tree construction:
 [1] "hou_value_m2"    "inc_gini"        "hou_development" "hou_rented"
 [5] "hou_owner"       "inc_theil"       "hou_boat"        "hou_occupants"
 [9] "hou_total"       "inc_social"

Plot the tree model:
#+begin_src R :results silent
plot(tree)
text(tree)
#+end_src

Confusion matrix for predictions
#+begin_src R :results silent
confusion(tree, houinc$district)
#+end_src

#+begin_src R :results silen
p <- predict(tree, type = "class")
accuracy(houinc$district, p)
precision(houinc$district, p)
recall(houinc$district, p)
#+end_src

#+RESULTS:
| 0.910714285714286 |
|              0.84 |
| 0.866666666666667 |
| 0.493670886075949 |
| 0.683544303797468 |
| 0.459016393442623 |
|  0.87037037037037 |

These actually score quite well, predictions are good except:
- Zuid is often predicted as West
- Noord is often predicted as Nieuw-West

